{
    "CLEMetroSchools": [
        [
            "Lincoln-West Global Studies hosted a citizenship ceremony today. Students helped tutor some of the newcomers for the citizenship test. https://t.co/K6317l07Zu https://t.co/OBcNOJC6yy",
            "Longtime CSA tutor Betsy Sampliner receives a Most Treasured Volunteer award from Center for Community Solutions. https://t.co/TNFZ61Fmze https://t.co/rwEHaBiSX7",
            "RT @CLEvolunteers: We have a limited number of stipend literacy tutor positions in @CLEMetroSchools. grades K-3. #CLE. 216-391-9500 x 119",
            "RT @CLEvolunteers: Did you know we tutored 891 @CLEMetroschools students last school year? Want to tutor? 216-391-9500 x 119. #aarpexperien…",
            "RT @CLEvolunteers: We have a limited number of stipend literacy tutor positions in @CLEMetroSchools. grades K-3. #CLE. 216-391-9500 x 119"
        ],
        [
            "RT @jewishcleveland: Meet Marc: He's been tutoring students in @CLEMetroSchools as a volunteer with #JewishCleveland's Public Education Ini…",
            "RT @BethuneEagles: On Friday @CLEMetroSchools @BethuneEagles kicked off their tutoring program with @caseathletics https://t.co/OJB6rIpSTo",
            "RT @Sarakidner: Thanks to @GatewayDowntown for tutoring at SuccessTech @CLEMetroSchools Saturday Academy for Ogt and credit recovery! http:…",
            "Boys &amp; Girls Club now serving students at FDR Academy until 6:00 pm daily!  Homework help/tutoring, music lessons, field trips, free dinner!"
        ],
        [
            "An after-school program provided by @AdvantageCLE at Mary B. Martin School is allowing students to get in touch with their feelings, receive access to tutors who help them with their homework, increase their literacy skills and discover tennis. Full Story: https://t.co/paIytYJNel https://t.co/NmiROTHfxX",
            "RT @CLEvolunteers: Reading! We are currently recruiting #volunteer to serve as #literacy tutors in @CLEMetroSchools &amp; @euclidschools \n@AARP…",
            "RT @Bolton_CMSD: . @jewishcleveland tutors working with our 5th grade scholars. Thanks for all you do!  #BetterTogether #LiteracyMatters ht…",
            "RT @CLEvolunteers: We are near to our goal of literacy tutors, age 50+, in @CLEMetroSchools. Can U volunteer? 216-391-9500. 5 hrs. per scho…",
            "RT @CLEvolunteers: Reading tutors needed in Bedford, Lakewood, Euclid &amp; @CLEMetroSchools. schools. 216-391-9500 x 123. #CLEliteracy http://…"
        ]
    ],
    "pbcsd": [
        [
            "RT @Philanthrotank: Thomás Carter, Christina Linder &amp; Mariele Sabat will be at the 2019 Live Finals Event presenting ART FOR THE SOUL.\nFREE…",
            "RT @depsuppalmbeach: Former SDPBC principal and former Roosevelt ES student come back to mentor/tutor present students @pbcsd https://t.co/…",
            "RT @lord_daisy: CTE preschool DEVINE JACKSON former tutor at JILHS now Marketing and Events Coordinator BRAMAN BMW #MakeItCountPBC@SDPBCCho…",
            "RT @DianaFedderman: Training over 200 volunteers to tutor Ss this summer.  So excited for this new partnership! @561Sdpbc @amitychandler ht…"
        ],
        [
            "Have you used @paperlearning yet for free online tutoring, homework help, essay review, and more for District students in grades 6-12? Parents are invited to tune in for a webinar at 5 p.m. TODAY to learn how Paper can aid in student success: https://t.co/rVPBzklGYq https://t.co/SCKgNXdW1Y",
            ".@paperlearning offers support for 200+ subject areas, including homework help, essay review, and test prep, whenever students need it. Tutoring services are available to students in English, Spanish, French, and Mandarin.\n\nGo to https://t.co/Ny63kH5NBV to get started now!",
            "Parents/guardians/families of students in grades 6-12 in District-operated schools are invited to an introductory webinar about @paperlearning!\nTune at 5pm on Thurs., 2/24, for a virtual webinar &amp; find out how to make the most of the free tutoring service: https://t.co/rVPBzklGYq https://t.co/LLXMwfcVvG",
            "Looking for homework help over the weekend or in the evenings? Students in grades 6-12 can use @paperlearning for free online tutoring! Access through the Portal or go to https://t.co/dqKpq7KtNW https://t.co/UIArCGAtcn",
            "Free tutoring for students in grades 6-12 anytime, anywhere. Search for \"Paper\" on the District Portal to get started with @paperlearning. https://t.co/Eaq9JCD50x",
            "Welcome back, teachers and staff! The new year brings with it new resources for you and your students. @PAPERlearning is an online 24/7 tutoring service for grades 6-12. Learn more here: https://t.co/4mtgtYUh63\n\nSearch for \"Paper\" on the District Portal to get started! https://t.co/UzqnwSpdg9",
            "Math tutoring and mentorship are adding up in big ways for students from Village Academy and @RPBHSOfficial. Read more about how actuaries from @NCCI and @ActuarialFound are supporting and inspiring students:  https://t.co/y73zMMsuSS https://t.co/oKUZDPIpot",
            "Whether tending to school gardens, counting box tops, remotely coordinating fundraisers, tutoring, or editing school newsletters, we couldn't do it without our volunteers. We look forward to having you back on our school campuses soon. We miss you! #NationalVolunteerWeek2021 https://t.co/KQSTdFxNeZ",
            ".@WellingtonHSFL @latinosinacti0n students connect with New Horizons Elementary students via Google Meet weekly for tutoring sessions. Find out why teachers from both schools say this mentorship program is mutually beneficial: https://t.co/MyniSA09Gj @FigueroaNHES https://t.co/bqFphPZBIM",
            "Need homework help? @pbclibrary is offering a FREE tutoring service. Students will need an active library card to use and access the service. Find out how to sign up for a free, temporary library e-card to access tutoring: https://t.co/2NUr6U5uCj https://t.co/177p4DuOV0"
        ],
        [
            "Ivey Colligan, known as \"Miss Ivey,\" strives to make students smile every day at Orchard View Elementary 💐👏🌟 She hasn't missed a day of work in five years, tutors students on weekends, and is now the District's School-Related Employee of the Year. Congratulations, Miss Ivey! https://t.co/SNzdzwiuPk",
            "We're proud of @GCHSRaiders student Marie Sintulaire, named a finalist of @TAKESTOCKPBC Leaders For Life Scholarship. Sintulaire is #1 in her class, and tutors Haitian immigrants, all while being dual-enrolled at @PBStateCollege @GladesRegionSup @GladesRegion @RepHastingsFL https://t.co/m5zkg2oSvY",
            ".@Jupmiddle Algebra students were in for a special surprise last week, as tutors from @MathNationFL visited the school to work with students in person! \"It was just like...meeting Beyonce or something...\" said Isaiah, an 8th grader at JMST. Watch ⬇#MakeItCountPBC🚀 https://t.co/nZp1FXDSGF",
            "RT @NorthRegionELA: Excellent PD @MichelleJ_WES for Academic Tutors supporting Double-Down in the ELA classroom #MakeitCountPBC @Area4SuptP…"
        ]
    ],
    "theSMSD": [
        [],
        [
            "RT @SMEOffice: Attention Students: No East for Excellence After-School Tutoring this week (Wednesday 3/25 or Thursday 3/26) due to ACT Prac…"
        ],
        [
            "RT @SMECounseling: FREE ACT Practice Test 4/4 @ 8:45 AM-12:30 PM at College Nannies &amp; Tutors of Overland Park overlandparkks@collegenannies…",
            "RT @SMECounseling: FREE ACT Practice Test March 7th @ 8:45 AM-12:30 PM. Contact College Nannies &amp; Tutors overlandparkks@collegenannies.com …",
            "RT @britton_haney: East 4 Excellence tutors are happy to help students every Wed and Thurs in the Library from 3:45 - 4:45. #needhelp http:…"
        ]
    ],
    "WWP_Schools": [
        [],
        [
            "At Community Middle School, #MentoringMatters. HSN students provide tutoring/mentoring in the Homework Tutorial program. Also, the Mentor program has staff check in w/ assigned students, twice a month to build connections &amp; help students navigate these times. https://t.co/0YckyfaWal",
            "8th grade students at Grover Middle School are leading the way when it comes to mentoring! They started a peer-led mentoring program for the German foreign language program, providing tutoring and so much more to students in all 3 grades. #MentoringMatters https://t.co/3Zvoqclk3u"
        ],
        []
    ],
    "ASD_Info": [
        [],
        [
            "Free online tutoring available every day for students thanks to grant from @AKStateLibrary. Details at http://t.co/QIfWVhb6",
            "Dept. of Defense offers free tutoring services for military families. http://bit.ly/95Nii0"
        ],
        [
            "Are you a middle or high school student that needs homework help? Sign up for a help session through the ASD Family and Student Support Center (https://t.co/XOP178yz9e) or at 742-HELP. Our tutors can help with math, language arts, social studies, and science. https://t.co/zqgtVvr9Bu"
        ]
    ],
    "lrsd": [
        [],
        [
            "RT @2019ATOY: Everyday I hear about teachers going above and beyond. Today is no exception. Shout-out to Ms. Claudine James for going the e…",
            "Approved: budget for elementary after school tutoring programs. Funding is from NSLA money.",
            "Free tutoring is available for LRSD students http://ow.ly/2zleE",
            "Tutoring programs available to LRSD students were outlined."
        ],
        [
            "AVID tutors needed— $10/hr. Read web article for qualifications.... http://t.co/SBe6vO3wjX",
            "AVID tutors neeeded—$10/hr. Read web article for qualifications. http://t.co/BvL2F6nuS3",
            "Check out this great story about AVID and how it is making a difference in the lives of LRSD students.   The... http://t.co/0oxt0MQJSG",
            "AR Kids Read is looking for 22 tutors for Chicot Elementary. Can you help meet the need? http://t.co/TZH8sMpY54",
            "AR Kids Read is looking for 8 volunteer tutors for Geyer Springs Elementary! http://t.co/HZ9obQymiw",
            "Still seeking tutors for 9 LRSD schools.... http://t.co/nVpLJVKLrp",
            "Paid tutors needed.\nhttp://t.co/WththA580m http://t.co/XLBaDKosgb",
            "Clifford is helping AR Kids Read recruit volunteer tutors at every grade level. Here Clifford is waving hello... http://t.co/X3fnRdxUoQ",
            "Clifford is helping AR Kids Read recruit volunteer tutors. Terry Elementary was his first stop! http://t.co/EPo40xskE6",
            "Tutors are needed for AVID program http://ow.ly/66F2C"
        ]
    ],
    "BeltonSchools": [
        [],
        [
            "PIRATES ON DECK...\n@BeltonMS124 Picture Retake Day\nBHS Student Success Center\nBMS Virtual Tutoring\n@BHSTheatre1158 Presents Virtual Play: All in the Timing, 7 pm: https://t.co/tcwn2OsOc3\n#Proud2BPirates https://t.co/aYc18LLgwT",
            "PIRATES ON DECK today...\n@CambridgePirate Online Book Fair\nPreK-12 Evening Zoom Parent/Teacher Conferences\n@BeltonMS124 Virtual Science Tutoring, 4 pm\nBHS FAFSA Frenzy Virtual Assistance, 6 pm\nKentucky Trail Parent Zoom Town Hall, 6 pm\n#Proud2BPirates https://t.co/ec0r4AtNyk",
            "PIRATES ON DECK today...\n@CambridgePirate Online Book Fair\nJV/V Boys @BeltonSoccer @ Truman\nVarsity @Pirate_VB MSHSAA Districts vs. G'view @ H'ville\nBHS Student Success Center, 3 pm\n@BeltonMS124 Virtual English Tutoring, 4 pm\nJV @Belton_Football vs. Grain Valley\n#Proud2BPirates https://t.co/Vx6xR2EI1e",
            "PIRATES ON DECK today...\nNo School, Staff Professional Development Day\n@CambridgePirate Online Book Fair\nJV @Belton_Football  vs. Grain Valley\n@BeltonMS124 Virtual Math Tutoring, 4 pm\n#Proud2BPirates https://t.co/AOUln647kO",
            "PIRATES ON DECK today...\nC/JV/V @Pirate_VB vs. Chrisman\nLive Stream Varsity 🏐: https://t.co/dsPsWvtRPy\nC @Belton_Football vs. Kearney\nJV/V Boys @BeltonSoccer @ Ft Osage\nBHS Evening Parent/Teacher Conferences\nBMS Zoom Tutoring: Social Studies\nBHS @FAFSA Frenzy Night https://t.co/TcTIKYVKBE",
            "PIRATES ON DECK today...\nJV/V Boys Swimming vs. KC East, Central, Lincoln Prep, Marshall, Rockhurst, Warrensburg\nBHS Fall @Choir_BHS Concert\n@BeltonMS124 Volleyball (C Team) @ Pioneer Ridge MS &amp; Raytown\nBHS Student Success Center\nBMS Zoom Tutoring: Science\n#Proud2BPirates https://t.co/n1LSHT0Avc",
            "PIRATES ON DECK today...\nC/JV/Varsity @Pirate_VB @ Fort Osage\nVarsity Boys @BeltonSoccer @ Grain Valley\n@BeltonMS124 Football @ Liberty\nBHS Student Success Center\nBMS Zoom Tutoring: Language Arts, ESL, &amp; Sped Support\n#Proud2BPirates https://t.co/XzOQEJLGKM",
            "PIRATES ON DECK today...\nJV @Belton_Football @ Chrisman\n@BeltonMS124 Volleyball (A &amp; B Teams) vs Osage Trail MS\nBMS Zoom Math Tutoring\nBHS Student Success Center\n#Proud2BPirates https://t.co/T7E49Xxj7y",
            "PIRATES ON DECK today:\n@BeltonMS124 XC @ Ray-Pec East MS\nBMS Volleyball vs Moreland Ridge\nVarsity Boys @BeltonSoccer Tournament vs. Spring Hill \nJV/V Girls Golf vs. Raytown\nBHS &amp; BMS Tutoring - check Pirate Post for details: https://t.co/ZZE76JkyHo\n#Proud2BPirates https://t.co/lN7ukJHcvh",
            "Due to a meeting after school tomorrow at BHS, tutoring and service hours are cancelled for December 2nd.  Thanks, Pirates!"
        ],
        []
    ],
    "BVSDcolorado": [
        [],
        [
            "RT @ImpactOnEd: From school-based tutoring to RTD bus passes to an online math software, our Academic Opportunity Fund provided $100K in gr…",
            "RT @ImpactOnEd: Targeting students who are behind in literacy and math and don’t have other school supports, we invested $265,000 in a vari…",
            "RT @ImpactOnEd: A tax-deductible gift today, will help students like Gene, a recently homeless student who began a Boulder elementary schoo…"
        ],
        [
            "Does your child struggle with reading, writing or math? Consider attending the Struggling Readers Symposium 12:30-4 pm on October 21. There will be an opportunity for you to ask your questions to reading tutors, teachers, education therapists and neuropsychologists. https://t.co/kpZdRofIdK"
        ]
    ],
    "SumnerSchools": [
        [],
        [],
        [
            "RT @PierceCoLibrary: Is common core math testing your patience? Did you forget what makes a participle dangle? Get your students free help…",
            "RT @PierceCoLibrary: Confused by calculus? Struggling with science? Access professional tutors FREE with your Pierce County Library card...…"
        ]
    ],
    "LeeSchools": [
        [],
        [
            "RT @0093River: Out of 128 Tutoring students...only 7 students did not make gains!!!! River Hall Elementary is ALL about our data!!! #TakeOw…",
            "RT @EsteroHS: NHS MEETING with Mrs. Smock after school in the Cafe. The place to be at 1:45 PM!!! #servicebeforeself #tutoring @LeeSchools…",
            "RT @VarsityLakesMS: All after school activities have been cancelled. This includes the soccer game, NJHS dance, Step Team practice, and tut…",
            "RT @FortMyersMiddle: Tutoring forms went home with all FMMA students! Parents! Please return forms even if you are opting out! #leetweets",
            "RT @HancockCreekEl: Peer tutoring in Kindergarten http://t.co/nKbMFX4qsm"
        ],
        []
    ],
    "62schools": [
        [
            "RT @AmadeiMichael: Des Plaines School District 62 seeks EL Tutor / Assistant to work at Orchard Place Elementary School.  #62workingtogethe…",
            "Experienced Reading Tutor Sought \n\nIroquois Community School seeks one volunteer to work one-on-one with second... http://t.co/1YotzrnK"
        ],
        [
            "Fortunate to have partnerships with @DPPL that support our students. Free tutoring for 6-12 grade students available Tuesdays from 6-8 p.m. https://t.co/j7mOtAb6qU",
            "Today, PALS Peer Tutoring(12:10-1 PM), Cooking Club (3:30-4:30 PM), & Journalism Club (12:10-1 PM) meet at Plainfield.",
            "TODAY! PALS Peer Tutoring, Journalism Club, 12:10-1 PM, Plainfield Elementary School"
        ],
        [
            "Tutors &amp; Mentors: Dist. 62 Recognizes Efforts Of Orchard Place Program https://t.co/oWklygH8Px",
            "D62 Seeks Reading Tutors\n\nSchool District 62 seeks volunteers (50+) who could spend one hour a week during the... http://t.co/58xr50Hz",
            "Thursday, March 15 • Virtual Bulletin Board Posted • Newspaper Club, AST, Tutors &amp; Computers, 3 PM, Algonquin •... http://t.co/PC1PlU5u",
            "Wednesday, March 7 Reminders\nISAT Testing Continues\nBook Club, Girls Volleyball@Chippewa, Tutors & Computers,... http://t.co/vaiQbPYp",
            "Algonquin Happenings, Girls V-Ball@Friendship, Book Club, Tutors & Computers, Scrabble Club, STEM Club, & AST, All-3 PM",
            "AST, Knitting Club, Tutors & Computers, Today, 3 PM, Algonquin Middle School",
            "What's happening at Algonquin? \n7:30 AM, 8th grade photo retakes\n3 PM, AST, Newspaper Club, Tutors & Computers, Girls V-Ball vs Lincoln",
            "Volunteer Needed – Apply Today!\n\nReading Intervention Tutors Sought – Cumberland  Elementary School, 700 Golf... http://t.co/t1YSaL5e",
            "D62 Reading Program Needs Tutors http://t.co/ARQDRQx",
            "Chippewa Needs Reading Tutors. Call Connie Smith at 847-824-1503 to volunteer."
        ]
    ],
    "sd129": [
        [
            "Merry Tutors are WAHS National Honor Society members, and they are available to tutor elementary, middle, and high school students for FREE! \n\n📍Aurora Public Library West Branch\n🗓Thursdays, starting March 3\n⏰3:45-5:30 PM. \nPlease show up with your materials and questions! https://t.co/L3oMJAzFwt"
        ],
        [
            "FREE VIRTUAL TUTORING\n\nSD129 is pleased to announce the start of a district-wide English and Mathematics tutoring opportunity for our 6th through 12th-grade students.\n\nSIGN UP HERE! https://t.co/Al9q95W2Ct https://t.co/XJideD9W9D"
        ],
        [
            "Merry Tutors are WAHS National Honor Society members, and they are available to tutor elementary, middle, and high school students for FREE! \n\n📍Aurora Public Library West Branch\n🗓Thursdays, starting March 3\n⏰3:45-5:30 PM. \nPlease show up with your materials and questions! https://t.co/L3oMJAzFwt",
            "RT @waubonsee: Volunteers Needed as Adult Literacy Tutors http://t.co/tbXzdIaTus"
        ]
    ],
    "USD_232": [
        [],
        [
            "RT @USD232EF: Congratulations to Lexington Trails Middle School for receiving a $1,000 School Spotlight Grant to start an After School Tuto…"
        ],
        []
    ],
    "ClarkCountySch": [
        [
            "El padre / tutor del estudiante también puede recoger las comidas para los estudiantes sin el niño presente durante la recogida de la comida.\n \nLos sitios de comidas se pueden encontrar en línea en https://t.co/A7Vou3vKQ0.",
            "Los estudiantes pueden recoger las comidas en cualquier sitio de comida. El padre o tutor del estudiante también puede recoger las comidas para los estudiantes sin que el niño esté presente al recibir los alimentos.",
            "Los estudiantes pueden recoger las comidas en cualquier sitio de distribución de alimentos. El padre o tutor del estudiante también puede recoger las comidas para los estudiantes sin que el niño/a esté presente cuando se reciban los alimentos.",
            "RT @OrrMiddleSchool: Students utilizing Fluency Tutor in classes to improve reading fluency and better prepare them for the reading portion…",
            "Star Grad: Hassan Bhatti @swctacommunity is a Nat'l AP Scholar, volunteer, active club member, tutor and more! \nhttps://t.co/azvzpM6z4F https://t.co/Yq6jioKD4S",
            "After becoming a college tutor, Duncan ES's Sara Fronio knew she was meant to be a teacher. #TeacherTuesday #AEW2014 http://t.co/uLh9VQP8Zn"
        ],
        [
            "RT @ccronnow: Happy Monday! Today we start our support staff tutoring. This is a great way to build capacity in our building and often recr…",
            "RT @SmithCenterLV: Teacher Anna Stein earned a #HeartofEducation Award after creating a free bilingual tutoring program for Spanish-speakin…",
            "RT @ccsd_i: Free tutoring at @HendersonEQCtr https://t.co/RwxXUM2dts",
            "RT @CCSD_FACES: FAQ: Are there any resources for additional math or reading support after school? \n\nFACES: YES! Contact⬇️\n@LVCCLD : https:/…",
            "RT @NevadaReady: Today, @NVSupt and @JulianaUrtubey3 were able to tour Ty’s Place, a safe space for teen mentorship. SO many student servic…",
            "Watch 💜 this heartwarming video of @tanakaweareone Summer Acceleration. Students learned academics, socialized, received tutoring and played sports. This program provided a positive experience to a lot of our students. Thanks to everyone at our schools for making CCSD #1ForKids. https://t.co/wX5YIjtAa0",
            "RT @ccsd_i: Contact Henderson Equality Center for more information regarding tutoring services! See flyer for details. https://t.co/SojgSHf…",
            "RT @ccsd_i: Henderson Equality Center offers free tutoring, 3 times a week. One hour sessions are overseen by licensed, certified teachers…",
            "Free tutoring program helps students on Las Vegas Westside https://t.co/Nv339GqnLe via @fox5vegas",
            "Tutoring and Academic Support:\n\nCCSD families have access to the Learning Line, a service in which CCSD personnel provide support for all students via telephone to maximize learning through distance education. This service may be reached at 702-799-6644 when school starts."
        ],
        [
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is here for all your homework help needs 🎒 ✏️ 🎓! This drop-in servi…",
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is back &amp; ready to help with all your homework help needs 🎒 ✏️ 🎓! T…",
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is back &amp; ready to help with all your homework help needs 🎒 ✏️ 🎓! T…",
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is back &amp; ready to help with all your homework help needs 🎒 ✏️ 🎓! T…",
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is back &amp; ready to help with all your homework help needs 🎒 ✏️ 🎓! T…",
            "RT @LVCCLD: The Library District Foundation FREE Teacher Tutors program is back &amp; ready to help with all your homework help needs 🎒 ✏️ 🎓! T…",
            "RT @CCSD_FACES: Live @ClarkCountySch tutors are back at the @LVCCLD libraries starting September 7, 2021! Stop in Monday to Thursday from 4…",
            "RT @CCSD_FACES: FAQ: Are there any resources for additional math or reading support after school? \n\nFACES: YES! Contact⬇️\n@LVCCLD : https:/…",
            "RT @hendersonlibs: Back to school means back to #homework! But don't let that overwhelm your child. Connect with free online tutors every d…",
            "RT @Teach_Vegas: Looking for a great part-time opportunity?\nHere's your chance! CCSD is looking for part-time Paraprofessional Tutors to jo…"
        ]
    ],
    "dcsdk12": [
        [
            "🎓 Meet Tanner Leonard, an Outstanding Graduate from Rock Canyon High School. Tanner helped  to tutor local elementary school students. He plans to major in mathematics at the University of Virginia.\n\nRead more about DCSD's Outstanding Graduates here: https://t.co/RQuFjNvxYe https://t.co/hHP2GH0MoW"
        ],
        [
            "🎓 Meet Brodric Bassett, an Outstanding Graduate from ThunderRidge High School. He raised $5,000 for computer equipment and provided tutoring to children in Uganda. He will attend Davidson College this fall. \n\nRead more about DCSD's Outstanding Graduates: https://t.co/RQuFjNvxYe https://t.co/vMhl0M9YPA",
            "Thanks to the Expelled and At-Risk Student Grant, struggling students will have more opportunities to receive tutoring, counseling, assessments, and support at their main schools through the Douglas County Student Support Center. Read more at https://t.co/RDl0UiskIt. https://t.co/bZmwJlGJzL"
        ],
        []
    ],
    "PHLschools": [
        [],
        [
            "“Literacy Tools for Schools Celebration &amp; Launch” kicked off at Benjamin B. Comegys Elementary School today! The program serves as the official launch of Vello, an innovative, one-on-one tutoring program that matches… https://t.co/QMch43Ro9e"
        ],
        []
    ],
    "HoustonISD": [
        [
            "Hey parents! You can help lead the way by signing up to be a part of the HIPPY team! Become a parent tutor today. We’re looking for English and Spanish speakers to work with students. Learn more at https://t.co/nollD2jH17. https://t.co/9ZKb7AzefV",
            "RT @jackyatesELA: Pull outs by our fabulous Yancy Group tutor @JackYatesHigh #gobegreat #thepoweroftutoring https://t.co/oAPtBy0bXY",
            "Want to help families create a foundation for academic success? Apply now to become a HIPPY parent tutor! https://t.co/ssxIKj28bI",
            "RT @TutorMate: Thanks to great HISD teachers &amp; online weekly reading tutors from Chase &amp; Transwestern! #HISDSOTS  signup as a tutor! http:/…",
            "RT @TutorMate: Why volunteer to tutor? See @HoustonChron OpEd from @HoustonISD Chief Acad Officer @danielgohl http://t.co/nWqq8QYOlW http:/…",
            "RT @IFLearning: Thx @nmbush 4 being a @TutorMate tutor to a 1st grdr at Scarborough ES in @HoustonISD @BushHoustonLit @PointsofLight http:/…",
            "RT @lmenster: @HoustonISD @TutorMate Just had an awesome online http://t.co/8GPowVKQCq tutor session with DuJaun at Wesley Elem!!! http://t…",
            "RT @TutorMate: Grateful to @DavidWeekley team who will tutor @HoustonISD Grade 1 kids online each wk! You can too!  http://t.co/qzZDnZFg5N",
            "Are you committed to changing children's lives for the better? Do you have strong math skills? Be an Apollo 20 tutor! http://t.co/S9k2obBPnu",
            "RT @Apollo20Fellow: Join us at Workforce Solutions - Southwest today for more info about becoming an HISD Apollo Tutor 9:30-2:30"
        ],
        [
            "Deadline extended until Dec. 10 to join Student Teacher Corps. Don't miss out on this great opportunity!\nhttps://t.co/wZAdkfLDoU https://t.co/QRJt7LW8ka",
            "HISD announces Student Teacher Corps, now accepting applications\n#HISD\nhttps://t.co/wZAdkfLDoU https://t.co/rSYqmKrfPb",
            "Apply now to join #HISD Student Teacher Corps\nhttps://t.co/wZAdkfLDoU https://t.co/Sj4GRNhiNM",
            "HISD announces bold tutoring partnership with @iEducateUSA \nhttps://t.co/wZAdkg3egs @HISD_Partners https://t.co/hlC71JXS1R",
            "Included in the plan: \n✅ +$135 million on human capital and compensation\n✅+$127 million to expand curriculum resources and library supports\n✅+$113 million to academic interventions and tutoring https://t.co/rMLAlY5o0i",
            "Did you know that all HISD students automatically have a @houstonlibrary card? The Learning Link! And that card has access to books, audiobooks, NO LATE FEES, and 24/7 online tutoring. #HISDParentU https://t.co/2IMicVZygm",
            "RT @CarnegieRhinos: CVHS students are starting a free online one on one tutoring service for students in grades 3-8. They are truly making…",
            "HS Students: The @CarnegieRhinos student-created tutoring service company Numerly is seeking students for tutoring and leadership roles! The deadline to apply is Dec. 20! To learn more, visit https://t.co/JcfnecSnEn! https://t.co/XomYiawOpf",
            "COVID-19 has presented several educational challenges, but two @CarnegieRhinos students saw it as an opportunity for positive change! \n\nRead their amazing story at https://t.co/n2D7Yr7zLE. https://t.co/HLsG26yqGN",
            "🚨HISD ALUM: Do you have a passion for tutoring, teaching, and mentoring? Then @iEducateUSA would love for you to join them!\n\niEducate is looking for college students interested in being an elementary school mentor! Apply to be a mentor today at https://t.co/ZT39WOLJUM https://t.co/8y1fTsDZzN"
        ],
        [
            "ICYMI: #HISD hiring 500 students and alumni as elementary tutors to address learning loss\n\nhttps://t.co/NhBJPFQf7u https://t.co/gpOLOzRunb",
            "RT @HISD2College: @HoustonISD @emergevillage @HISD_ROSES @HISD_ATMP iEducate is seeking 👀recent HS graduates to serve as PAID💰tutors &amp; ment…",
            "Since the loss of her brother, Sofia has continued to excel academically. She is actively engaged in school activities and on her free time she tutors Ketelsen Elementary students for STAAR testing. #HISDProud @Santos4hisd @HISDSupe @northside_hs",
            "RT @DesignSherman: Day 2: Our 5th grd Minecraft tutors @ShermanES1 helping our 2nd graders build simple structures. #12daysofcode https://t…",
            "Middle &amp; high school, as well as college students worked as tutors/mentors with @CodwellES students for three weeks this summer.",
            "#HISD graduates in program would work as tutors/mentors for #HISD students while in college, then return as #HISD teachers after graduation.",
            "RT @IFLearning: Way cool @Chase Houston #volunteer @TutorMate tutors wrapped up their gr8 yr at @HoustonISD Lyons ES! @BushHoustonLit http:…",
            "RT @IFLearning: Today @nmbush &amp; Linbeck Grp @TutorMate tutors at @HoustonISD Scarborough met their tutees F2F! Gr8 yr! @PointsofLight http:…",
            "RT @ScarboroughA20: TutorMate end of they year celebration. Thank you to all the tutors for your time with the scholars! http://t.co/iVbymz…",
            "RT @TutorMate: These awesome @Smart_Financial employees just formed a team of online reading tutors in @HoustonISD @BushHoustonLit http://t…"
        ]
    ],
    "NISD": [
        [
            "Starting this Monday, Aug. 31, we're offering Online Student Homework Support free of charge to all NISD students after hours &amp; on weekends. A certified Teacher Tutor will be available via video conferencing, screen share, or chat. #NISDBackTogetherBetter https://t.co/Xvq5dt9Krj",
            "OASIS tutors wanted. Training provided. Make a difference &amp; tutor a child. Details here- https://t.co/zLS9Pbuq93 https://t.co/loi2GRxggF"
        ],
        [
            "Reminder that our online tutoring and attendance recovery is still available today during normal hours. https://t.co/opMuri90Ep",
            "Starting tomorrow, Sept. 7, we're offering online tutoring support for students. Certified Teacher Tutors will be available to help students from kindergarten through 12th grade. #NISDReunited https://t.co/64Ys9G2naT",
            "Teacher tutors like Katie Gerlich from @NISDCCA are making a difference for students and families! Thanks to @News4SA for highlighting their efforts to provide homework support after hours and on weekends. #NISDBackTogetherBetter https://t.co/gxDTkW8XR0",
            "NISD partner OASIS looking for adults over 50 to spend 1 hr/wk tutoring elementary students- https://t.co/zLS9Pbuq93 https://t.co/jYWe4GjqT0"
        ],
        [
            "Starting tomorrow, Sept. 7, we're offering online tutoring support for students. Certified Teacher Tutors will be available to help students from kindergarten through 12th grade. #NISDReunited https://t.co/64Ys9G2naT",
            "#ICYMI- Kathy Lyssy, our Director of Student Advocacy &amp; School Choice, appeared on @ksatnews this morning to talk about our online Homework Support &amp; Teacher Tutors! https://t.co/VSEBZBPjWK",
            "Teacher tutors like Katie Gerlich from @NISDCCA are making a difference for students and families! Thanks to @News4SA for highlighting their efforts to provide homework support after hours and on weekends. #NISDBackTogetherBetter https://t.co/gxDTkW8XR0",
            "\"Virtual learning takes a village and I am blessed to be part of it!\" This week we began offering free Online Student Homework Support after hours &amp; on weekends. Meet some of the Teacher Tutors who are ready to help NISD students- https://t.co/uyVr6vIcvx https://t.co/cRewU4iKV0",
            "RT @NISDKnowlton: Proud to have over 20 parent volunteers serving as tutors to increase student literacy skills. #bettertogether #padrescon…",
            "RT @NISDKnowlton: Parent volunteers are getting trained and are ready to serve as tutors to promote early literacy. Padres aprendiendo como…",
            "OASIS tutors wanted. Training provided. Make a difference &amp; tutor a child. Details here- https://t.co/zLS9Pbuq93 https://t.co/loi2GRxggF"
        ]
    ],
    "ScottsdaleUSD": [
        [],
        [
            "When you make a contribution to SUSD, your tax credit can be used to support enrichment &amp; athletic programs, tutoring, field trips &amp; more to help our students achieve success inside &amp; outside the classroom! Make a tax credit contribution now at https://t.co/WsekFoDdrt. https://t.co/bSqqr9YECO",
            "A partnership between the Scottsdale Parent Council, the City of Scottsdale &amp; SUSD is bringing the Intergenerational Tutoring Program to Hohokam &amp; Yavapai this year! Beginning this month, senior volunteers will meet with students after school, once a week for about an hour. https://t.co/4wl4RZeqry",
            "Tax credits help w/tutoring, field trips, enrichment/athletics, PSAT, SAT, ACT, IB &amp; more! https://t.co/dISnceKEXh https://t.co/GfoaOu3ynU",
            "Donations support education, music, tutoring, field trips, athletics &amp; more! It’s a win-win for you &amp; SUSD students https://t.co/VdQvQfyzPe"
        ],
        [
            "Volunteer Tutors Needed – You Have so Much to Offer! Share it with a Child! Please visit our Web site at www.susd.org for more information.",
            "Volunteer Tutors Needed – You Have so Much to Offer! Share it with a Child!  Visit www.susd.org for more information."
        ]
    ],
    "AlmaSchools": [
        [],
        [
            "RT @Alma_MrsEngelke: We ❤️ peer tutoring! #mathworkshop https://t.co/EugmWNR5rU",
            "RT @AlmaAcademics: Early morning tutoring with Ms Parker - learning all about protons &amp; neutrons &amp; electrons! https://t.co/eujtrLSOtz",
            "RT @alma_middle: Great peer tutoring by 8th grade students going on in Math this morning! https://t.co/Bhz7jp3V1n",
            "After school tutoring is back in session today at the Middle School!"
        ],
        []
    ]
}